### Pandas Part1 : Practical Questions

##### Question 1
 Create a Series using a list of 5 fruit names. Assign custom index labels to each element.

In [21]:
import pandas as pd
import numpy as np
fruits=['mango','apple','banana','pineapple','pomogranate']
l = ['A','B','C','D','E']
s = pd.Series(fruits,index = l)
print(s)

A          mango
B          apple
C         banana
D      pineapple
E    pomogranate
dtype: object

##### Question 2

 Create a DataFrame from the following dictionary: 

 
{
 'Name': ['Alice', 'Bob', 'Charlie'],
 'Age': [25, 30, 35],
 'City': ['Pune', 'Mumbai', 'Nagpur'
}

In [22]:
df = pd.DataFrame({
 'Name': ['Alice', 'Bob', 'Charlie'],
 'Age': [25, 30, 35],
 'City': ['Pune', 'Mumbai', 'Nagpur']
})
df

      Name  Age    City
0    Alice   25    Pune
1      Bob   30  Mumbai
2  Charlie   35  Nagpur

##### Question 3
 Create a DataFrame using NumPy to generate a 3x3 matrix of random integers between 1 and 100. Assign
 column names as 'A', 'B', 'C'

In [23]:
data = np.random.randint(1,100,size = (3,3))
df1= pd.DataFrame(data,columns=['A','B','C'])
print(df1)

    A   B   C
0  50  27  84
1  20  77  56
2  42  82  32

 ##### Question 4
 Using the DataFrame from Question 2, display: - First 2 rows - Last row - Shape of the DataFram

In [24]:
df

      Name  Age    City
0    Alice   25    Pune
1      Bob   30  Mumbai
2  Charlie   35  Nagpur

In [26]:
df.iloc[0:2,0:3]

    Name  Age    City
0  Alice   25    Pune
1    Bob   30  Mumbai

In [28]:
df.iloc[2:3,0:3]

      Name  Age    City
2  Charlie   35  Nagpur

In [29]:
df.shape

(3, 3)

##### Question 5
 Use .info() and .describe() on the DataFrame created in Question 2

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [31]:
df.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

##### Question 6
 From the DataFrame in Question 2, select only the 'Name' and 'City' columns using loc

In [34]:
df.loc[:,['Name','City']]

      Name    City
0    Alice    Pune
1      Bob  Mumbai
2  Charlie  Nagpur

##### Question 7
 From the DataFrame in Question 2, use iloc to display the second row.

In [36]:
df.iloc[1]

Name       Bob
Age         30
City    Mumbai
Name: 1, dtype: object

##### Question 8
 Rename the 'Age' column to 'Years' in the DataFrame from Question 2

In [37]:
df.rename(columns={'Age': 'Years'}, inplace=True)
print(df)

      Name  Years    City
0    Alice     25    Pune
1      Bob     30  Mumbai
2  Charlie     35  Nagpur

##### Question 9
 Drop the 'City' column from the DataFrame in Question 2

In [39]:
df.drop(columns='City', inplace=True)
print(df)

      Name  Years
0    Alice     25
1      Bob     30
2  Charlie     35

##### Question 10
 Modify the 'Years' column (previously 'Age') by adding 5 to each value

In [40]:
df['Years'] = df['Years'] + 5
print(df)

      Name  Years
0    Alice     30
1      Bob     35
2  Charlie     40